# Проект FitLife - MVP версия 1.0
import time
print('Вас приветствует цифровой фитнес-трекер FitLife!')
time.sleep(2)
print('Моя задача-рассчитать индекс массы тела и рекомендованную норму воды в день')
time.sleep(2)
print('Давайте знакомиться!')

# 1. Знакомство
# TODO: Спроси у пользователя имя и сохрани в переменную user_name
user_name = input('Как вас зовут?').title()

# TODO: Спроси возраст и сохрани в переменную user_age (не забудь преобразовать в число)
user_age = int(input('Сколько вам лет?'))

# 2. Сбор данных
# TODO: Запроси вес (в кг) и сохрани в user_weight (тип float)
user_weight = float(input('Введите ваш вес (кг):'))

# TODO: Запроси рост (в метрах, например 1.75) и сохрани в user_height (тип float)
user_height = float(input('Введите ваш рост (м):'))

# 3. Логика расчетов (Функции как "черный ящик": используем арифметику)
# Формула ИМТ: вес разделить на (рост в квадрате)
# TODO: Рассчитай bmi (Индекс массы тела)
bmi = user_weight / (user_height ** 2)
bmi = round(bmi, 1)

# Подсчет воды: вес * 30 мл
# TODO: Рассчитай water_needed
water_ml = user_weight * 30
water_needed = water_ml / 1000
water_needed = round(water_l, 1)

# 4. Вывод красивого результата
# TODO: Используй f-строку, чтобы вывести приветствие, например: "Привет, Иван!"
# TODO: Выведи возраст, ИМТ (округленный до 1 знака) и норму воды.
print(f'Отчет для пользователя:', user_name,',',user_age,'лет')
time.sleep(2)
print(f'Твой Индекс Массы Тела:', bmi)
time.sleep(2)
print(f'Рекомендуемая норма воды:', water_needed,'л. в день')
time.sleep(2)
print('')
print("Расчет окончен. Будьте здоровы!")
